"""
# 文字コード
    - ASCIIコードは主に英語圏で使われる文字コード
    - 基礎的な文字コード
    - 1文字を1バイトで表現

# 10進数, 2進数, 16進数
    - 10進数は人間が扱う数値
    - 2進数はPCが扱う数値
    - 16進数は、2進数を文字に変換する時に簡単に出来た
    - 2進数→10進数→文字コードは難しい
    - 昔はパンチカード

# Shift - JIS符号化方式
    - ASCIIコードに漢字などの日本語を追加した文字コード

# Unicode符号化文字規格
    - 世界中の文字を単一文字集合として扱う符号化文字集合規格
    - 実際はあまり機能していない

# UTF-8符号化方式
    - ASCIIコードに世界中の文字を加えたのがUTF-8
    - ASCIIコードだけでは表現しきれない日本語にも対応
    - 世界中のあらゆる文字に対応しているため、世界標準の文字コード

# バイト列 バイナリ列
    - 0と1の並びを
    - 8桁ずつ → バイト列
    - 1桁ずつ → バイナリ列

# Base64
    - エンコード方式の一つ」
    - 
"""
